STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver_type.h
/**
  * @brief Structure defining the base memory configuration.
  */
typedef struct
{
  uint32_t                         Frequency;                                     /*!< Operating frequency */
  uint16_t                         CommandRead;                                   /*!< Command to read data */
  uint16_t                         CommandWrite;                                  /*!< Command to write data */
  uint16_t                         DummyCycleRead;                                /*!< Number of dummy cycles for read operations */
  uint16_t                         DummyCycleWrite;                               /*!< Number of dummy cycles for write operations */
  uint16_t                         DummyRegisterRead;                             /*!< Number of dummy cycles for Read Reg operations */
  EXTMEM_CUSTOM_AccessModeTypeDef  AccessMode;                                    /*!< Access mode (e.g., 1S4D4D) */
  EXTMEM_CUSTOM_AccessModeTypeDef  OptWriteAccessMode;                            /*!< Optional Access mode for Write operation (e.g., 1S4D4D) */
  EXTMEM_CUSTOM_InstruSizeTypeDef  InstructionSize;                               /*!< Size of the instruction */
  EXTMEM_CUSTOM_AddrSizeTypeDef    AddressSize;                                   /*!< Size of the address */
  EXTMEM_CUSTOM_DqsModeTypeDef     DqsMode;                                       /*!< Data strobe mode */
} MemoryBaseConfigTypeDef;


/**
  * @brief Structure defining optional memory configuration parameters.
  */
typedef struct
{
  uint32_t                         AlternateByteMode;                             /*!< Alternate byte mode (e.g., 1S, 4D) */
  uint32_t                         AlternateByteSize;                             /*!< Size of the alternate byte */
  uint32_t                         SampleShift;                                   /*!< 1/2 Cycle SDR */
  uint32_t                         Dhqc;                                          /*!< 1/4 Cycle (DTR) maybe STR */
} MemoryOptionalConfigTypeDef;


typedef struct
{
  EXTMEM_CUSTOM_SRAccessDetails    SRAccessDetails;                               /*!< Details about how to access SR for checking WIP, WEL bits */
  uint16_t                         Cmd_EraseSector;                               /*!< Command to erase a sector */
  uint16_t                         Cmd_MassErase;                                 /*!< Command to perform mass erase */
  uint16_t                         Cmd_RDSR;                                      /*!< Command to read status register */
  uint16_t                         Cmd_WE;                                        /*!< Command to enable write operations */
  uint8_t                          MatchMask_WEL;                                 /*!< Mask for write enable latch */
  uint8_t                          MatchValue_WEL;                                /*!< Match Value for write enable latch */
  uint8_t                          MatchMask_WIP;                                 /*!< Mask for write in progress */
  uint8_t                          MatchValue_WIP;                                /*!< Match Value for write in progress */
} NorFlashBasConfigTypeDef;


/**
  * @brief Define the NOR configuration structure
  */
typedef struct
{
  uint32_t                         PageSize;                                      /*!< Page Size (Max write) */
  uint32_t                         SectorSize;                                    /*!< Sector Size in bytes  */
  uint32_t                         MaxSectorEraseTime;                            /*!< Max time expected for completing a Sector Erase operation (in ms) */
  uint32_t                         MaxChipEraseTime;                              /*!< Max time expected for completing a Chip Erase operation (in ms) */
  NorFlashBasConfigTypeDef         Startup;                                       /*!< Config use after boot */
  uint8_t                          OptionalConfigEnable;                          /*!< Optional NorFlash config activation if different from boot (RDSR/WE/Erase commands)  */
  NorFlashBasConfigTypeDef         Optional;                                      /*!< Config use after memory setup if different from boot (RDSR/WE/Erase commands) */
} NorFlashConfigTypeDef;

/**
  * @brief Define the RAM configuration structure
  */
typedef struct
{
  uint32_t                         WrapSize;                                      /*!< Wrap size */
  uint32_t                         RowBoundarySize;                               /*!< Row boundary size */
} RamConfigTypeDef;

/**
  * @brief Define the optional register configuration structure for RW register
  */
typedef struct
{
  uint32_t                         RegisterAddress;                               /*!< Address of the register */
  uint16_t                         CommandRegisterWrite;                          /*!< Command to write to a register */
  uint16_t                         CommandRegisterRead;                           /*!< Command to read from a register */
  uint16_t                         CommandRegisterReadAW;                         /*!< Command to read from a register after write operation (only used in RWR operation type) */
  uint16_t                         RegisterValue;                                 /*!< Value of the register */
  uint16_t                         RegisterExpectedValue;                         /*!< Value expected of the register. Used for comparison in RAW operation */
  uint16_t                         RegisterMask;                                  /*!< Mask for the register */
} RegAccess_TypeDef;

/**
  * @brief Define the optional register configuration structure for Additional Instruction sending
  */
typedef struct
{
  uint16_t                         Instruction;                                   /*!< Instruction to be sent */
} Inst_TypeDef;

/**
  * @brief Define the optional register configuration and additional instructions structure
  */
typedef struct
{
  ConfigStepTypeDef                ConfigStepType;                                /*!< Type of configuration step : Status Register access, Instruction, ...  */
  union
  {
    RegAccess_TypeDef              RWConfigStep;                                  /*!< Config Step of type Register Access (R, W, RW, ...) */
    Inst_TypeDef                   INSConfigStep;                                 /*!< Config Step of type Instruction */
  };
} OptionalRegisterConfigTypeDef;

/**
  * @brief CUSTOM Driver JedecID Info structure definition
  */
typedef struct
{
  uint8_t                          ManufacturerID;                                /*!< JedecID (Manufacturer ID) */
  uint8_t                          MemoryType;                                    /*!< JedecID (Memory type)     */
  uint8_t                          MemoryDensity;                                 /*!< JedecID (Memory density)  */
} EXTMEM_CUSTOM_JedecIDTypeDef;

/**
  * @brief Define the optional register configuration structure
  */
typedef struct
{
  XSPI_HandleTypeDef               *Handle;                                       /*!< Pointer to the XSPI instance handle. */
  XSPI_RegularCmdTypeDef           Commandbase;                                   /*!< Command base configuration. */
  uint32_t                         RealClock;                                     /*!< Actual clock used by the memory. */
  uint32_t                         ReadRegValue;                                  /*!< Value read from register. */
  NorFlashBasConfigTypeDef         *CurrentFlashConfig;                           /*!< Pointer to the current Flash configuration. */
  EXTMEM_CUSTOM_JedecIDTypeDef     JedecID;                                       /*!< JEDEC ID retrieved from memory. */
} CustomPrivateTypeDef;

/**
  * @brief CUSTOM Driver object definition
  */
typedef struct
{
  CustomPrivateTypeDef             Private;                                       /*!< Private driver data. */
  EXTMEM_CUSTOM_MemTypeTypeDef     MemType;                                       /*!< Memory type. */
  EXTMEM_CUSTOM_MemStdTypeDef      MemStandard;                                   /*!< Memory standard (e.g., Macronix, Micron, etc.). */
  EXTMEM_CUSTOM_MemSizeTypeDef     MemSize;                                       /*!< Memory size. */
  EXTMEM_CUSTOM_ResetMethodTypeDef ResetMethod;                                   /*!< Reset method. */
  EXTMEM_CUSTOM_SShiftCfgTypeDef   SampleShiftCfg;                                /*!< Sample Shift configuration. */
  uint16_t                         ResetDelay;                                    /*!< Time needed after reset (in ms, 0 if no required delay). */
  uint16_t                         MemChipSelectHighTimeCycle;                    /*!< Chip select high time. */
  MemoryBaseConfigTypeDef          StartupConfig;                                 /*!< Startup configuration. */
  uint16_t                         NbRegisterConfig;                              /*!< Number of additional configuration commands or instructions to send to the memory. */
  OptionalRegisterConfigTypeDef    RegisterConfig[EXTMEM_CUSTOM_MAX_REG_CONFIG];  /*!< Additional configuration commands or instructions to send to the memory. */
  MemoryBaseConfigTypeDef          OptionalConfig;                                /*!< Optional configuration. */
  union
  {
    NorFlashConfigTypeDef          NorFlashConfig;                                /*!< NOR Flash configuration             */
    RamConfigTypeDef               PsramConfig;                                   /*!< PSRAM configuration                 */
  };
} EXTMEM_DRIVER_CUSTOM_ObjectTypeDef;

/**
  * @brief CUSTOM Driver Memory Info structure definition
  */
typedef struct
{
  EXTMEM_CUSTOM_MemTypeTypeDef     MemType;                                       /*!< Memory type. */
  EXTMEM_CUSTOM_MemSizeTypeDef     MemSize;                                       /*!< Memory size. */
  EXTMEM_CUSTOM_MemStdTypeDef      MemStandard;                                   /*!< Memory standard (e.g., Macronix, Micron, etc.). */
  EXTMEM_CUSTOM_AccessModeTypeDef  MemAccessMode;                                 /*!< Access mode (e.g., 1S4D4D). */
  uint32_t                         MemRealFreq;                                   /*!< Actual operating frequency. */
  EXTMEM_CUSTOM_JedecIDTypeDef     JedecID;                                       /*!< JEDEC ID retrieved from memory. */
} EXTMEM_DRIVER_CUSTOM_MemInfoTypeDef;
/**
  * @}
  */

/**
  * @}
  */
#endif /* EXTMEM_DRIVER_CUSTOM == 1 */

#ifdef __cplusplus
}
#endif

#endif /* __STM32_CUSTOM_TYPE_H */
